# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
df = pd.read_csv('NationalNames.csv')

In [3]:
df.head()

   Id       Name  Year Gender  Count
0   1       Mary  1880      F   7065
1   2       Anna  1880      F   2604
2   3       Emma  1880      F   2003
3   4  Elizabeth  1880      F   1939
4   5     Minnie  1880      F   1746

### Step 4. See the first 10 entries

In [4]:
df.head(10)

   Id       Name  Year Gender  Count
0   1       Mary  1880      F   7065
1   2       Anna  1880      F   2604
2   3       Emma  1880      F   2003
3   4  Elizabeth  1880      F   1939
4   5     Minnie  1880      F   1746
5   6   Margaret  1880      F   1578
6   7        Ida  1880      F   1472
7   8      Alice  1880      F   1414
8   9     Bertha  1880      F   1320
9  10      Sarah  1880      F   1288

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
df.drop('Id',axis=1,inplace=True)

In [6]:
df.head()

        Name  Year Gender  Count
0       Mary  1880      F   7065
1       Anna  1880      F   2604
2       Emma  1880      F   2003
3  Elizabeth  1880      F   1939
4     Minnie  1880      F   1746

### Step 6. Is there more male or female names in the dataset?

In [7]:
df['Gender'].value_counts()

F    1081683
M     743750
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [11]:
del df['Year']

names=df.groupby('Name').sum()

names.head()

print(names.shape)

names.sort_values('Count',ascending=0).head()

(93889, 1)

           Count
Name
James    5129096
John     5106590
Robert   4816785
Michael  4330805
Mary     4130441

In [15]:
names.head()

           Count
Name
Aaban         72
Aabha         21
Aabid          5
Aabriella     10
Aadam        196

### Step 8. How many different names exist in the dataset?

In [14]:
len(names)

93889

### Step 9. What is the name with most occurrences?

In [16]:
names.Count.idxmax()

'James'

### Step 10. How many different names have the least occurrences?

In [18]:
len(names[names['Count'] == names['Count'].min()])

13393

### Step 11. What is the median name occurrence?

In [19]:
names[names.Count == names.Count.median()]

           Count
Name
Abhijeet      45
Adaire        45
Adaleen       45
Adebola       45
Adream        45
...          ...
Zeni          45
Zhion         45
Zorka         45
Zyniyah       45
Zyrihanna     45

[340 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [20]:
names.Count.std()

55665.63350735194

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [22]:
names.describe()

              Count
count  9.388900e+04
mean   3.590787e+03
std    5.566563e+04
min    5.000000e+00
25%    1.100000e+01
50%    4.500000e+01
75%    2.370000e+02
max    5.129096e+06